Repository: domonov/AgroMap-Uzbekistan
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: uz

source: Submit
uz: Yuborish

source: Delete
uz: O'chirish

source: Search
uz: Qidirish

source: Street
uz: Ko'cha

source: Satellite
uz: Sun'iy yo'ldosh

source: Terrain
uz: Relief

source: Select crop type
uz: Ekin turini tanlang

source: Field size (hectares)
uz: Maydon hajmi (gektar)

source: Planting date
uz: Ekish sanasi

source: Add/Edit Crop Report
uz: Ekin hisobotini qo'shish/tahrirlash

source: Crop Types
uz: Ekin turlari

source: Search location...
uz: Manzilni qidirish...
